mips> c
        Simulator reset

mips> d

pc = 0
$0 = 0          $v0 = 0         $v1 = 0         $a0 = 0
$a1 = 0         $a2 = 0         $a3 = 0         $t0 = 0
$t1 = 0         $t2 = 0         $t3 = 0         $t4 = 0
$t5 = 0         $t6 = 0         $t7 = 0         $s0 = 0
$s1 = 0         $s2 = 0         $s3 = 0         $s4 = 0
$s5 = 0         $s6 = 0         $s7 = 0         $t8 = 0
$t9 = 0         $sp = 0         $ra = 0

mips> s
        1 instruction(s) executed
mips> d

pc = 1
$0 = 0          $v0 = 0         $v1 = 0         $a0 = 6
$a1 = 0         $a2 = 0         $a3 = 0         $t0 = 0
$t1 = 0         $t2 = 0         $t3 = 0         $t4 = 0
$t5 = 0         $t6 = 0         $t7 = 0         $s0 = 0
$s1 = 0         $s2 = 0         $s3 = 0         $s4 = 0
$s5 = 0         $s6 = 0         $s7 = 0         $t8 = 0
$t9 = 0         $sp = 0         $ra = 0

mips> s 10
        10 instruction(s) executed
mips> d

pc = 4
$0 = 0          $v0 = 0         $v1 = 0         $a0 = 5
$a1 = 0         $a2 = 0         $a3 = 0         $t0 = 3
$t1 = 0         $t2 = 0         $t3 = 0         $t4 = 0
$t5 = 0         $t6 = 0         $t7 = 0         $s0 = 0
$s1 = 0         $s2 = 0         $s3 = 0         $s4 = 0
$s5 = 0         $s6 = 0         $s7 = 0         $t8 = 0
$t9 = 0         $sp = 4092              $ra = 12

mips> r
mips> d

pc = 24
$0 = 0          $v0 = 8         $v1 = 0         $a0 = 2
$a1 = 0         $a2 = 0         $a3 = 0         $t0 = 5
$t1 = 1         $t2 = 0         $t3 = 0         $t4 = 0
$t5 = 0         $t6 = 0         $t7 = 0         $s0 = 0
$s1 = 0         $s2 = 0         $s3 = 0         $s4 = 0
$s5 = 0         $s6 = 0         $s7 = 0         $t8 = 0
$t9 = 0         $sp = 4095              $ra = 3

mips> q